app/views/posts/show.html.erb

  <h3>Tags:</h3>
  <% @post.post_tags.each do |post_tag| %>
    <% tag = @tags.find(post_tag.tag_id) %>
---
SELECT "post_tags".* FROM "post_tags" WHERE "post_tags"."post_id" = ?  [["post_id", 3]]
SELECT "tags".id FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = ?  [["post_id", 3]]