app/controllers/posts_controller.rb

  def show
    @tags = Tag.all
---
SELECT "post_tags".* FROM "post_tags" WHERE "post_tags"."post_id" = ?  [["post_id", 3]]

  def create
    @post = Post.new(post_params)
    # binding.pry
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "post title"], ["content", "post content"], ["created_at", "2015-07-06 20:56:13.536109"], ["updated_at", "2015-07-06 20:56:13.536109"]]